{
    "tests": { 
        "test1": {
            "command": ["Run the Atmospheric composition Analysis. use the designated wavelengths.",
                        "Proceed with the Atmospheric compostion Analysis, focus on the gas signatures in the expected ranges.",
                        "Proceed with the atmospheric scan using the spectrometer to identify gas signatures."],
            "success": ["Alright... The analysis is complete! Readings are all in.", 
                        "Now that's what I'm talking about! We’re locked in. This is it. Prepare yourself, 'cause we’re about to crack open this planet's atmosphere like a piñata. Just sit tight, here comes the good stuff.", 
                        "Bingo! Now you’re speaking my language. We’ve hit the sweet spot. Get ready, 'cause this planet’s about to spill its secrets. The good stuff’s coming up!", 
                        "Alright, Spectrometer’s reading looks clean. No worries here!",
                        "We're all set! Everything checks out just fine.",
                        "Looks like the readings came through just fine. Everything’s as expected.",
                        "Now we’re talking! You nailed it, mi hermano. We’re right where we need to be. Hold tight, 'cause we’re about to hit paydirt!"],
            "close": ["Not bad, not bad at all. We’re getting closer, I can feel it. But not quite there yet. Keep your eyes peeled, amigo. We’re almost sniffing the right trail.",
                    "Closer, but not quite there. You’re almost on the money, but it’s still a little off. We’re in the right neighborhood, but not on the right street.",
                    "You’re on the right track, but still a bit off. I can feel we’re near the target, but not quite hitting the bullseye. Close, but no cigar.",
                    "Not too bad, but you’re still off by a bit. You’re poking around the edges, but we’re not quite in the zone yet. Almost there, just a little more.",
                    "Mmm, you’re close, real close. I can almost taste it, but we’re not quite there yet. Just a little more tweaking, and we’ll be right on the money.",
                    "Well, well, well… You’re in the neighborhood, but still a few blocks away. You’re not lost, but we need to dig a little deeper, amigo."],
            "failure": ["*Sighs* That did not work. Didn’t get any useful data.",
                        "Still too far, buddy. We’re not even in the ballpark. This one’s gonna leave us with nothing but a blank slate.",
                        "Hmm, something’s not right. We didn’t get the results we were hoping for.",
                        "That’s strange… I didn’t get any useful data. Might need another look.",
                        "Hmm, you took a swing, but you missed, my friend. Too far off the mark. Don’t expect much from this one; we’re not exactly knocking on the right door here.",
                        "I got some readings, but they seem a little off. Maybe we should try another pass?",
                        "Ah, that’s a swing and a miss. You went too far, way too far. We’re not even close, my friend. This one’s a bust, don’t expect any favors."]
        },
        "test2":{
            "command": ["Deploy the suitable probe for surface temperature measurement.",
                                "Use the suitable probe to measure the surface temperature."],
            "success-standard": ["Ah, now that’s a smart choice! You’ve got a knack for this, my friend. Let’s deploy this little guy and see what kind of temperature readings we can scoop up. I’m feeling good about this one!",
                                "Looks like everything’s perfect on this end. The standard probe got us the readings.",
                                "Nice! We’ve got solid data from the standard probe.",
                                "Hmmm... Great choice! You’ve got the right tool for the job. Let’s see what kind of temperature we’re dealing with here. I have a good feeling about this!"],
            "success-high": ["Now we’re cooking! The high-temperature probe is doing its thing. Let’s grab that data! I can already feel the warmth of some juicy numbers coming in!",
                            "High-temperature probe readings came in clean. Everything checks out.",
                            "Now we’re talking! You’ve got the right gear for the job. Let’s drop this probe and get to the bottom of things. Here’s hoping for some hot data to feast on!",
                            "High-temp probe’s on fire —well, not literally— but it did a great job!"],
            "success-deep": ["Deep probe got the job done! All data’s looking great.",
                            "Well, that went deep, and we’ve got the results. Nice job!",
                            "Deep probe’s in action, and I’m ready for some real action! Let’s dig deep and uncover those subsurface temperatures. I can almost taste the data!",
                            "Beautiful! The deep probe went all the way and got us exactly what we needed."],
            "out-standard":["Looks like we’re all out of Standard Probes. Time to get creative!",
                            "No Standard Probes left in inventory. What’s your next move?",
                            "Sorry, but we’ve run out of Standard Probes. Let’s find an alternative.",
                            "Standard Probes are out of stock. We’ll need to pivot to a different strategy!"],
            "out-high":["No High-Temperature Probes available at the moment. What will you choose next?",
                        "Sorry, but there are no High-Temperature Probes in stock right now. What’s your plan?",
                        "The High-Temperature Probes are out of stock. Let’s look for another solution!",
                        "High-Temperature Probes are out of stock. How would you like to proceed?"],
            "out-deep":["Deep Probes are currently out of stock. Let’s try something different!",
                        "No Deep Probes available right now. What will you do next?",
                        "We’ve run out of Deep Probes. What’s your game plan now?",
                        "Deep Probes are out of stock. Time to adjust our approach!"],
            "failure-standard": ["Hmm, something’s not right. The standard probe didn’t return useful data.",
                                "Bad news... The standard probe melted. Looks like it couldn't handle the temperature.",
                                "Oh no, amigo, this isn’t gonna end well. The standard probe is already overheating! Looks like we’re out of luck; it’s broken by the heat. We need to rethink our approach here!",
                                "The standard probe seems to be malfunctioning. We’re getting nothing useful."],
            "failure-high": ["Come on, high-temp probe! We need some results, and you’re not delivering.",
                            "Whoa, hold on there! This bad boy isn’t built for a gentle touch. The probe can’t even get a read; the temperature isn’t reaching the minimum value. Looks like we’re in the wrong neighborhood!",
                            "Using a sledgehammer to crack a nut huh! No readings at all.",
                            "Uh-oh, this isn’t good. The high-temperature probe is struggling to even get a read. No minimum value detected. Classic case of 'wrong tool for the job!'"],
            "failure-deep": ["No data from the deep probe. We’ll need to troubleshoot that.",
                            "Alright, the deep probe is in action. But hold on... I’m not seeing any surface here. Just endless gas! Looks like we’re swimming in nothing but air. Time to rethink our strategy.",
                            "Alright, the deep probe is in the field. Just sitting here... waiting... Wait a second. There’s no surface to penetrate! This planet’s like a big fluffy cloud—no solid ground at all!",
                            "Alright, deployed the deep probe, but... wait a minute. I’m not getting anything here. No surface to penetrate. It’s like looking for a diamond in the sky—ain’t nothing there! Time to pivot!"]
        },
        "test3":{
            "command": ["Run the radar imaging tool to scan the surface.",
                            "Initiate a full radar sweep to sacn the data."],
            "success-LowF": ["Alright, going with the low frequency, huh? Not a bad choice. We’ll get a decent read on the surface. It’s not the whole picture, but it’s enough to give us a glimpse of what’s down there. Let’s see what we’ve got coming up…",
                            "Low frequency, eh? Heh, you like playing it safe. No rush, no fuss—let's just take a little peek under the surface, yeah? Don’t worry, I got you. Let’s see what’s cooking down there… Ah, there we go. Nice and easy.",
                            "Going with the low frequency, I see. It’s a solid move, gives us a decent reading without too much interference. Let’s flip the switch and see what secrets the surface has been hiding. Hang tight… here comes the info!",
                            "Going for the low frequency, eh? Smart move! It’s like fishing with a small net—might not catch everything, but you’ll reel in something interesting. Let’s see what this planet has hiding beneath the surface…"],
            "success-HighF": ["Ah, now we’re talking. High frequency’s the way to go if you want the full scoop. We’ll cut through the noise and get right down to the details. Brace yourself, we’re about to uncover some serious data…",
                            "Ho ho! High frequency, I see you don’t mess around! You want everything—front row seat, all the details. Perfect! Hold tight, this one's gonna hit hard. Ready? Boom! There’s the first wave… and wait for it… bingo, another one. Got the full picture now, don’t you?",
                            "High frequency, huh? Smart choice! This will slice right through the noise and give us a clearer picture of what’s lurking down below. Prepare for some solid intel coming your way!",
                            "Oh, you’ve got the right idea with high frequency! This will give us a detailed look at what’s going on. We’ll slice through that data like a hot knife through butter. Buckle up, we’re diving deep…"],
            "failure-LowOut": ["Hmm, looks like our low frequency’s tapped out. Must’ve pushed it too hard on those last scans. We’ll need to save that for another time. Time to step it up or switch gears, 'cause this one’s not gonna work anymore.",
                            "Oh, amigo, we’ve run this baby dry. Low frequency? Gone. Empty. We squeezed it till the last drop. You know what that means, right? Time to go big or go home, my friend. Let’s make it count.",
                            "Ah, no low frequency left in the tank! Looks like we used it all up on the last scan. Guess we’ll have to pivot to something else. No low vibes today, my friend!",
                            "Uh-oh, looks like we’ve run out of low frequency options. It’s like trying to find a needle in a haystack with no hay left. We’ll have to crank it up or find another angle to get that data."],
            "failure-HighOut": ["Well, well, looks like our high frequency gear is out of commission. Must’ve overdone it last time. Time to either improvise or shift gears—no point in fishing without bait, right?",
                                "Uh-oh, we’re out of high frequency radar! It seems we’ve pushed our limits too far. We’ll need to find another way to get the data we need. No high stakes for us right now!",
                                "Ahh, looks like we burned out the high frequency, huh? This thing’s been working overtime, and now? Pfft, it’s done for. Outta juice. But hey, no worries—we’ll find another way. We always do, right?",
                                "Damn, we’ve been running this thing hot, and now it’s finally given out. High frequency’s toast for now. Might have to stick to the basics or try something else, 'cause this one’s not coming back online."]
        },
        "test4":{
            "command": ["Run the transit scan on the planet.",
                            "Proceed with the transit scan."],
            "success-1hr": ["Alright, amigo, let’s get this quick observation rolling! One hour is all we need to snatch some intel. Fingers crossed we hit the jackpot!",
                            "Alright, my friend, just a quick one-hour observation. Let’s see if this planet has any secrets it’s willing to spill. Fingers crossed we hit the jackpot!",
                            "A quick hour, huh? Let’s get this show on the road! I’ve got a feeling we’re about to uncover some juicy details. Buckle up!",
                            "One hour in the cosmic spotlight? Just enough time to snag some secrets! Let’s see what this planet is hiding. Ready to roll!"],
            "success-3hr": ["Three hours? Perfect! That’s enough time to catch some real action. Let’s see what kind of cosmic dirt we can uncover!",
                            "Three hours of observation? Perfect. We’ll get a nice view of this planet. Let’s reel in some intel and see what’s really going on!",
                            "Three hours? Perfect! Time to dig deep and see what we can unearth. Let’s charm some info out of this planet and see what it’s hiding!",
                            "Three hours—now that’s a solid chunk of time! We’re gonna uncover some juicy details. Let’s make this count, my friend!"],
            "success-6hr": ["Six hours? Perfect! This is our golden opportunity to dive deep. Let’s see what secrets this planet has been hiding!",
                            "Six hours, baby! This is where the magic happens. Let’s kick back and see what we can find. I have a good feeling about this!",
                            "Alright, six hours—this is where we dig deep! Let’s see what this planet has been keeping under wraps. I have a good feeling about this!",
                            "Six hours of observation? Now we’re talking! Let’s dig deep and find out what this planet’s been keeping secret. I’m feeling good about this!"],
            "out-1hr":["Looks like our short observation tool hit a wall. It needs a recharge before we can dig back in. Just like a good plan, it requires a little rest!",
                        "Uh-oh, our short observation tool needs a little downtime. Just like a good plan, it requires a recharge before we dive back in. Patience, my friend!",
                        "Looks like our short observation tool needs a little recharge. Just like a good con needs time to set up. We’ll have to sit this one out for now.",
                        "Looks like our short observation tools need a recharge. We won’t be using those again, so let’s move on and find another angle, alright?"],
            "out-3hr":["Our medium observation tools are running low and need a recharge. We won’t be using them again, so let’s pivot and find another way to gather intel!",
                        "Our medium observation tool is all out of juice. Needs a recharge—just like any good scheme that requires a little patience. We’ll have to wait it out.",
                        "Looks like our medium observation tool is out of juice. Time for a recharge. Just like a good scheme, it takes time to brew!",
                        "Uh-oh, our medium observation tool needs to recharge. It’s like a heist—sometimes you just need to take a breather before going back in!"],
            "out-6hr":["Looks like our long observation tool needs some downtime. It’s like every good plan—it takes time to recharge before we strike again!",
                        "Ah, our long observation tool is needing a recharge. Just like a heist, it takes time to prepare. We’ll wait it out this time!",
                        "Uh-oh, looks like our long observation tool needs a recharge. Just like a good scheme that takes time to brew. We’re on pause for now.",
                        "Uh-oh, the long observation tools need a recharge and won’t be available again. Time to switch gears and think of another approach!"],
            "failure": ["It’s a total blank. This is confusing. We’ll get it right next time!",
                        "What? Nothing came through? I was convinced we had it locked down! Did I miss a signal? I’m all mixed up. Let’s clear our heads and try again!",
                        "Huh? No data? What gives? We aimed well, but... wait, did we? I think I might have messed something up in the setup. Let’s figure this out next time!",
                        "No data? This is perplexing! We had everything lined up! Did I forget to calibrate? Oh, man, I’ve got to pay more attention!"]
        }
    }
}